Repository: ANTPHAM/manual-french
Catalog: po/cypher.po
Languages: fr

source: _Cypher_ is a declarative graph query language that allows for expressive and efficient querying and updating of the graph store without having to write traversals through the graph structure in code. Cypher is still growing and maturing, and that means that there probably will be breaking syntax changes. It also means that it has not undergone the same rigorous performance testing as other Neo4j components.
fr: Cypher est un langage de requêtage déclaratif. Il permet d'effectuer des requêtes et mises jour du graphe efficaces sans avoir écrire de traversiers. Cypher is encore en phase d'évolution et de maturation, ce qui signifie qu'il y aura certainement des changes de syntaxe qui ne seront pas rétro compatibles. Cela signifie aussi que Cypher n'a pas encore t soumis aux tests de performance rigoureux comme les autres composants Neo4j.

source: Cypher is designed to be a humane query language, suitable for both developers and (importantly, we think) operations professionals who want to make ad-hoc queries on the database. Our guiding goal is to make the simple things simple, and the complex things possible. Its constructs are based on English prose and neat iconography, which helps to make it (somewhat) self-explanatory.
fr: Cypher est destiné à être un langage de requêtage humain, approprié aussi bien aux développeurs qu'aux ( et cela nous semble important ) testeurs qui veulent faire des requêtes ad-hoc sur la base de données. Notre ligne de conduite est de rendre simple les choses simples et possible les choses complexes. Sa construction est basée sur la prose Anglaise et une iconographie innée, ce qui aide à rendre ce langage auto-descriptif.

source: Cypher is inspired by a number of different approaches and builds upon established practices for expressive querying. Most of the keywords like +WHERE+ and +ORDER BY+ are inspired by http://en.wikipedia.org/wiki/SQL[SQL]. Pattern matching borrows expression approaches from http://en.wikipedia.org/wiki/SPARQL[SPARQL].
fr: Cypher est inspiré de plusieurs approches et construit sur des pratiques établies pour le requêtage expressif. La plupart des mots clefs comme +WHERE+ et +ORDER BY+ sont inspirés de http://en.wikipedia.org/wiki/SQL[SQL]. La concordance de patterns emprunte les approches d'expression de http://en.wikipedia.org/wiki/SPARQL[SPARQL].

source: Being a declarative language, Cypher focuses on the clarity of expressing _what_ to retrieve from a graph, not _how_ to do it, in contrast to imperative languages like Java, and scripting languages like http://gremlin.tinkerpop.com[Gremlin] (supported via the <<gremlin-plugin>>) and http://neo4j.rubyforge.org/[the JRuby Neo4j bindings]. This makes the concern of how to optimize queries an implementation detail not exposed to the user.
fr: En étant un langage déclaratif, Cypher se concentre sur la clarté d'exprimer _quoi_ retrouver dans un graphe et non _comment_ le faire. Ceci est en contraste aux langages impératifs comme Java et aux langages script comme http://gremlin.tinkerpop.com[Gremlin] (supporté via le <<gremlin-plugin>>) et http://neo4j.rubyforge.org/[the JRuby Neo4j bindings]. Ce qui rend le fait d'optimisation de requêtes un détail d'implémentation non exposé aux utilisateurs.

source: The query language is comprised of several distinct clauses.
fr: Le langage de requêtage comporte un nombre de clauses distinctes.

source: +START+: Starting points in the graph, obtained via index lookups or by element IDs.
fr: +START+: Points de départ dans le graphe, obtenus via un lookup d'index ou via des ID d'éléments.

source: +MATCH+: The graph pattern to match, bound to the starting points in +START+.
fr: +MATCH+: Le pattern du graphe à correspondre, lié aux points de départ dans +START+.

source: +WHERE+: Filtering criteria.
fr: +WHERE+: Critère de filtrage.

source: +RETURN+: What to return.
fr: +RETURN+: Ce qu'il faut retourner.

source: +CREATE+: Creates nodes and relationships.
fr: +CREATE+: Crée des noeuds ou des relations.

source: +DELETE+: Removes nodes, relationships and properties.
fr: +DELETE+: Efface des noeuds, relations ou propriétés.

source: +SET+: Set values to properties.
fr: +SET+: Affecte des valeurs aux propriétés.

source: +FOREACH+: Performs updating actions once per element in a list.
fr: +FOREACH+: Effectue des actions de mise à jour une fois par élément dans une liste.

source: +WITH+: Divides a query into multiple, distinct parts.
fr: +WITH+: Divise une requête en de multiples parties distinctes.

source: Let's see three of them in action.
fr: Voyons voir trois d'entre elles en action.

source: To use Cypher from Java, see <<tutorials-cypher-java>>. For more Cypher examples, see <<data-modeling-examples>> as well.
fr: Pour utiliser Cypher depuis Java, voyez <<tutorials-cypher-java>>. Pour plus d'exemples Cypher, voyez aussi <<data-modeling-examples>>.

source: Operators
fr: Opérateurs

source: Operators in Cypher are of three different varieties -- mathematical, equality and relationships.
fr: Les opérateurs dans Cypher sont de trois variétés différentes: mathématiques, égalités et relationnelles.

source: The mathematical operators are `+`, `-`, `*`, `/` and `%`. Of these, only the plus-sign works on strings and collections.
fr: Les opérateurs mathématiques sont `+`, `-`, `*`, `/` et `%`. De ceux-ci, seulement le signe plus fonctionne sur des chaînes de caractères et collections.

source: The equality operators are `=`, `<>`, `<`, `>`, `<=`, `>=`.
fr: Les opérateurs d'égalité sont `=`, `<>`, `<`, `>`, `<=`, `>=`.

source: Since Neo4j is a schema-free graph database, Cypher has two special operators -- `?` and `!`.
fr: Comme Neo4j est une base de données graphe schema-free, Cypher a deux caractères spéciaux -- `?` and `!`.

source: They are used on properties, and are used to deal with missing values. A comparison on a property that does not exist would normally cause an error. Instead of having to always check if the property exists before comparing its value with something else, the question mark make the comparison always return true if the property is missing, and the exclamation mark makes the comparator return false.
fr: Ils sont utilisés sur les propriétés et sont destinés à traiter avec des valeurs manquantes. Une comparaison sur une propriété qui n'existe pas causerait normalement une erreur. Au lieu de vérifier tout le temps si une propriété existe avant de comparer sa valeur avec autre chose, le point d'interrogation rend la comparaison toujours vraie si la propriété manque, et le point d'exclamation rend la comparaison toujours fausse dans le même cas.

source: This predicate will evaluate to true if +n.prop+ is missing.
fr: Ce prédicat évaluera à vrai si +n.prop+ est manquant.

source: This predicate will evaluate to false if +n.prop+ is missing.
fr: Ce prédicat évaluera à faux si +n.prop. est manquant.

source: Mixing the two in the same comparison will lead to unpredictable results.
fr: Mixer les deux dans une même comparaison peut mener à des résultats non prévisibles.

source: This is really syntactic sugar that expands to this:
fr: C'est vraiment un jeu d'enfant quand on voit ce qui en ressort:

source: Imagine an example graph like the following one:
fr: Imaginez un exemple de graphe comme le suivant:

source: Example Graph
fr: Graphe Exemple

source: For example, here is a query which finds a user called John in an index and then traverses the graph looking for friends of Johns friends (though not his direct friends) before returning both John and any friends-of-friends that are found. [source,cypher]
fr: Par exemple, ici une requête qui trouve un utilisateur nommé John dans un index et traverse le graphe afin de trouver les amis de John (mais pas ses amis directs) en retournant John et les amis des amis de John. [source,cypher]

source: Resulting in: [queryresult]
fr: Résultant en: [queryresult]

source: Next up we will add filtering to set more parts in motion:
fr: A présent, nous allons ajouter un filtrage afin de voir plus de parties en mouvement:

source: In this next example, we take a list of users (by node ID) and traverse the graph looking for those other users that have an outgoing +friend+ relationship, returning only those followed users who have a +name+ property starting with +S+. [source,cypher]
fr: Dans cet exemple, nous prenons une liste d'utilisateurs (par ID de noeud) et traversons le graphe en recherchant les autres utilisateurs qui ont une relation sortante +friend+, retournant seulement les utilisateurs parcourus qui ont une propriété +name+ commençant par un +S+. [source,cypher]

source: Resulting in [queryresult]
fr: Résultant en [queryresult]

source: An expression in Cypher can be:
fr: Une expression dans Cypher peut être:

source: A numeric literal (integer or double): `13`, `40000`, `3.14`.
fr: Un littérale numérique (integer ou double): `13`, `40000`, `3.14`.

source: A string literal: `"Hello"`, `'World'`.
fr: Une chaîne littérale: `"Hello"`, `'World'`.

source: A boolean literal: `true`, `false`, `TRUE`, `FALSE`.
fr: Un booléen littérale: `true`, `false`, `TRUE`, `FALSE`.

source: An identifier: `n`, `x`, `rel`, `myFancyIdentifier`, +\`A name with weird stuff in it[]!`+.
fr: Un identifiant: `n`, `x`, `rel`, `myFancyIdentifier`, +\`Un nom avec plein de jam dedans[]!`+.

source: A property: `n.prop`, `x.prop`, `rel.thisProperty`, +myFancyIdentifier.\`(weird property name)`+.
fr: Une propriété: `n.prop`, `x.prop`, `rel.thisProperty`, +myFancyIdentifier.\`(nom de propriété bizarre)`+.

source: A nullable property: it's a property, with a question mark or exclamation mark -- `n.prop?`, `rel.thisProperty!`.
fr: Une propriété qui peut être null: C'est une propriété avec un point d'interrogation ou un point d'exclamation -- `n.prop?`, `rel.thisProperty!`.

source: A parameter: `{param}`, `{0}`
fr: Un paramètre: `{param}`, `{0}`

source: A collection of expressions: `["a", "b"]`, `[1,2,3]`, `["a", 2, n.property, {param}]`, `[ ]`.
fr: Une collection d'expressions: `["a", "b"]`, `[1,2,3]`, `["a", 2, n.property, {param}]`, `[ ]`.

source: A function call: `length(p)`, `nodes(p)`.
fr: Un appel de fonction: `length(p)`, `nodes(p)`.

source: An aggregate function: `avg(x.prop)`, `count(*)`.
fr: Une fonction d'agrégation: `avg(x.prop)`, `count(*)`.

source: Relationship types: `:REL_TYPE`, +:\`REL TYPE`+, `:REL1|REL2`.
fr: Des types de relations: `:REL_TYPE`, +:\`REL TYPE`+, `:REL1|REL2`.

source: A path-pattern: `a-->()<--b`.
fr: Un pattern de chemin: `a-->()<--b`.

source: A predicate expression is an expression that returns true or false: a.prop = "Hello", length(p) > 10, has(a.name)
fr: Un prédication d'expression est une expression qui retourne vrai ou faux: a.prop = "Hello", length(p) > 10, has(a.name)

source: Note on string literals
fr: Note sur les chaînes littérales

source: String literals can contain these escape sequences.
fr: Les chaînes littérales peuvent contenir ces séquences d'échappement.

source: |Escape sequence|Character |`\t`|Tab |`\b`|Backspace |`\n`|Newline |`\r`|Carriage return |`\f`|Form feed |`\'`|Single quote |`\"`|Double quote |`\\`|Backslash
fr: |Séquence d'échappement|Caractère |`\t`|Tabulation |`\b`|Retour |`\n`|Nouvelle ligne |`\r`|Retour chariot |`\f`|Form feed |`\'`|Guillemet simple |`\"`|Guillemet double |`\\`|Barre oblique inversée

source: Parameters
fr: Paramètres

source: Cypher supports querying with parameters. This allows developers to not to have to do string building to create a query, and it also makes caching of execution plans much easier for Cypher.
fr: Cypher supporte le requêtage avec paramètres. Cela permet aux développeurs de ne pas devoir construire de chaînes afin de créer une requête, cela facilite également la mise en cache de plans d'exécution pour Cypher.

source: Parameters can be used for literals and expressions in the +WHERE+ clause, for the index key and index value in the +START+ clause, index queries, and finally for node/relationship ids. Parameters can not be used as for property names, since property notation is part of query structure that is compiled into a query plan.
fr: Les paramètres peuvent être utilisés pour des littérales et expressions dans la clause +WHERE+, pour la clé d'index et pour la valeur d'index dans la clause +START+, les requêtes d'index et finalement pour les id de noeuds/relations. Les paramètres ne peuvent pas être utilisés pour les noms de propriétés du fait que la notation de propriétés fait partie de la structure de requête qui est compilée dans le plan de requête.

source: Accepted names for parameter are letters and number, and any combination of these.
fr: Les noms de paramètres peuvent contenir des lettres, des chiffres et n'importe quelle combinaison de ceux-ci.

source: Here follows a few examples of how you can use parameters from Java.
fr: Les exemples suivants démontrent comment vous pouvez utiliser les paramètres en Java.

source: Parameter for node id
fr: Paramètre pour un id de noeud

source: Parameter for node object
fr: Paramètre pour un objet noeud

source: Parameter for multiple node ids
fr: Paramètre pour plusieurs id de noeuds

source: Parameter for string literal
fr: Paramètre pour une chaîne littérale

source: Parameter for index key and value
fr: Paramètre pour une clé d'index et valeur

source: Parameter for index query
fr: Paramètre pour une requête d'index

source: Numeric parameters for +SKIP+ and +LIMIT+
fr: Paramètres numériques pour +SKIP+ et +LIMIT+

source: Parameter for regular expression
fr: Paramètre pour une expression régulière

source: Identifiers
fr: Identifiants

source: When you reference parts of the pattern, you do so by naming them. The names you give the different parts are called identifiers.
fr: Quand vous référencez des parties du pattern, vous le faites en les nommant. Les noms que vous donnez aux différentes parties sont appelés des identifiants.

source: In this example:
fr: Dans cet exemple:

source: The identifiers are +n+ and +b+.
fr: Les identifiants sont +n+ et +b+.

source: Identifier names are case sensitive, and can contain underscores and alphanumeric characters (a-z, 0-9), but must start with a letter. If other characters are needed, you can quote the identifier using backquote (+`+) signs.
fr: Les noms d'identifiants sont sensibles à la casse et peuvent contenir des underscores et des caractères alphanumériques (a-z, 0-9) mais doivent commencer par une lettre. Si d'autres caractères sont nécessaires, vous pouvez utiliser l'identifiant en utilisant le guillemet inverse (+`+).

source: The same rules apply to property names.
fr: Les mêmes règles s'appliquent aux noms de propriétés.

source: Comments
fr: Commentaires

source: To add comments to your queries, use double slash. Examples:
fr: Pour ajouter des commentaires dans vos requêtes, utilisez des doubles barres obliques. Exemples:

source: START n=node(1) RETURN b //This is an end of line comment
fr: START n=node(1) RETURN b //Commentaire en fin de ligne

source: START n=node(1) //This is a whole line comment RETURN b
fr: START n=node(1) //Ligne complète de commentaire RETURN b

source: START n=node(1) WHERE n.property = "//This is NOT a comment" RETURN b
fr: START n=node(1) WHERE n.property = "//Ce n'est PAS un commentaire" RETURN b

source: Updating the graph
fr: Mise à jour du graphe

source: Cypher can be used for both querying and updating your graph.
fr: Cypher peut être utilisé aussi bien pour requêter que pour mettre à jour le graphe.

source: The Structure of Updating Queries
fr: La Structure de Requêtes de Mise à Jour

source: Quick info
fr: Info flash

source: A Cypher query part can't both match and update the graph at the same time.
fr: Une partie de requête Cypher peut très bien trouver dans le graphe et le mettre à jour en même temps.

source: Every part can either read and match on the graph, or make updates on it.
fr: Chaque partie peut également lire et trouver dans le graphe, ou même le mettre à jour.

source: If you read from the graph, and then update the graph, your query implicitly has two parts -- the reading is the first part, and the writing is the second. If your query is read-only, Cypher will be lazy, and not actually pattern match until you ask for the results. Here, the semantics are that _all_ the reading will be done before any writing actually happens. This is very important -- without this it's easy to find cases where the pattern matcher runs into data that is being created by the very same query, and all bets are off. That road leads to Heisenbugs, Brownian motion and cats that are dead and alive at the same time.
fr: Si vous lisez dans le graphe et que vous le mettez ensuite à jour, votre requête contient implicitement deux parties -- la lecture est la première partie et l'écriture la seconde. Si votre requête est une simple lecture, Cypher sera fainéant et ne fera pas de pattern matching tant que vous ne demandiez de résultats en retour. Ici la sémantique est que _toutes_ les lectures seront effectuées avant n'importe quelle écriture. Ceci est très important! Sans cela il est facile de trouver des cas où le pattern matcher rencontrera des données qui ont été créées par cette même requête et toutes les prédictions sont réduites à néant. Cette route mène à Heisenbugs, au mouvement Brownien et les chats qui sont morts et en vie en même temps.

source: First reading, and then writing, is the only pattern where the query parts are implicit -- any other order and you have to be explicit about your query parts. The parts are separated using the `WITH` statement. `WITH` is like the event horizon -- it's a barrier between a plan and the finished execution of that plan.
fr: D'abord lire, ensuite écrire est le seul pattern où les parties de requêtes sont implicites -- tout autre ordre et vous devez être explicite à propos de vos parties de requêtes. Les parties sont séparées en utilisant le `WITH`. `WITH` est comme l'horizon -- c'est une barrière entre un plan et l'exécution de ce plan.

source: When you want to filter using aggregated data, you have to chain together two reading query parts -- the first one does the aggregating, and the second query filters on the results coming from the first one.
fr: Quand vous voulez filtrer en utilisant des données agrégées, vous devez lier ensemble deux parties de requêtes -- la première fait l'agrégation et la suivant filtre sur les données venant de la première.

source: Using `WITH`, you specify how you want the aggregation to happen, and that the aggregation has to be finished before Cypher can start filtering.
fr: En utilisant le `WITH`, vous spécifiez comment vous voulez que l'agrégation se fasse et cette agrégation doit être finie avant que Cypher commence son filtrage.

source: You can chain together as many query parts as you have JVM heap for.
fr: Vous pouvez lier ensemble autant de parties de requêtes que vous désirez si vous avez un heap JVM pour.

source: Returning data
fr: Retourner des données

source: Any query can return data. If your query only reads, it has to return data -- it serves no purpose if it doesn't, and it is not a valid Cypher query. Queries that update the graph don't have to return anything, but they can.
fr: Chaque requête peut retourner des données. Si votre requête ne fait que lire, elle doit retourner des données -- cela n'a pas de but si elle ne retourne rien et ne sera pas considérée comme requête Cypher valide. Les requêtes qui mettent à jour le graphe ne doivent pas nécessairement retourner des données, mais peuvent.

source: After all the parts of the query comes one final `RETURN` statement. `RETURN` is not part of any query part -- it is a period symbol after an eloquent statement. When `RETURN` is legal, it's also legal to use `SKIP`/`LIMIT` and `ORDER BY`.
fr: Après toutes les parties d'une requête vient le déclaratif final `RETURN`. `RETURN` ne fait partie d'aucune partie de requête -- c'est une virgule après les parties de requête. Quand `RETURN` est autorisé, il est aussi autorisé d'utiliser `SKIP`/`LIMIT` et `ORDER BY`.

source: If you return graph elements from a query that has just deleted them -- beware, you are holding a pointer that is no longer valid. Operations on that node might fail mysteriously and unpredictably.
fr: Si vous retournez des éléments d'un graphe qui viennent juste d'être supprimés -- faites attention, vous détenez un pointeur qui n'est plus valide. Des opérations sur ce noeud peuvent échouer mystérieusement et imprévisiblement.

source: Any query that updates the graph will run in a transaction. An updating query will always either fully succeed, or not succeed at all.
fr: Chaque requête qui met le graphe à jour doivent s'effectuer dans une transaction. Chaque requête de mise à jour sera toujours soit complètement réussie, soit complètement échouée.

source: Cypher will either create a new transaction, and commit it once the query finishes. Or if a transaction already exists in the running context, the query will run inside it, and nothing will be persisted to disk until the transaction is successfully committed.
fr: Cypher créera une nouvelle transaction et la commitera une fois que la requête est terminée. Ou si une transaction existe déjà dans le contexte courant, la requête sera exécutée dedans et rien ne sera persisté sur le disque tant que la transaction n'est pas commitée.

source: This can be used to have multiple queries be committed as a single transaction:
fr: Ceci peut être utilisé afin d'avoir plusieurs requêtes committées comme une seule transaction:

source: Open a transaction,
fr: Ouvrir une transaction,

source: run multiple updating Cypher queries,
fr: effectue plusieurs requêtes Cypher de mise à jour

source: and commit all of them in one go.
fr: et les commiter toutes en même temps.

source: Note that a query will hold the changes in heap until the whole query has finished executing. A large query will consequently need a JVM with lots of heap space.
fr: Notez qu'une requête retiendra tous les changements dans le heap tant que toute la requête ait fini de s'exécuter. Une grande requête aura pour conséquence de nécessiter une JVM avec beaucoup d'espace de heap.
